package com.teachmeskills.lesson_9.task5;

/**
 *   5. Дана произвольная строка.
 *   Вывести на консоль новую строку, которой задублированно каждая буква из начальной строки.
 *   Например, "Hello" -> "HHeelllloo"
 */

public class Main {
    public static void main(String[] args) {

        String sd = ("Hello");

        System.out.println(MainDemo.getNewString(sd));
    }
}